#### `terraform apply` Success
<details><summary>Show Output</summary>

```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_storage_bucket.private-bucket will be created
  + resource "google_storage_bucket" "private-bucket" {
      + bucket_policy_only          = (known after apply)
      + force_destroy               = false
      + id                          = (known after apply)
      + labels                      = {
          + "app" = "test-app"
          + "env" = "test"
        }
      + location                    = "ASIA-NORTHEAST1"
      + name                        = "private-bucket-abc1234"
      + project                     = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "REGIONAL"
      + uniform_bucket_level_access = (known after apply)
      + url                         = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
google_storage_bucket.private-bucket: Creating...
google_storage_bucket.private-bucket: Creation complete after 1s [id=private-bucket-abc1234]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.

```

</details>

*Workflow: `terraform apply`, Action: `__hashicorp_terraform-github-actions_2`, Working Directory: `.`, Workspace: `default`*
